NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B520F2048IQ100.svd
        <register>
          <name>EXTIFCTRL</name>
          <description>External Override Interface Control</description>
          <addressOffset>0x048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000F1</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable External Interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTSEL</name>
              <description>APORT Selection for External Interface</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APORT0X</name>
                  <description>APORT0X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT0XCH0.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT0Y</name>
                  <description>APORT0Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT0YCH0.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1X</name>
                  <description>APORT1X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT1XCH0.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1Y</name>
                  <description>APORT1Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT1XCH0.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XY</name>
                  <description>APORT1X/Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT1XCH0.</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2X</name>
                  <description>APORT2X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT2YCH0.</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2Y</name>
                  <description>APORT2Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT2YCH0.</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YX</name>
                  <description>APORT2Y/X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT2YCH0.</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3X</name>
                  <description>APORT3X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT3XCH0.</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3Y</name>
                  <description>APORT3Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT3XCH0.</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XY</name>
                  <description>APORT3X/Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT3XCH0.</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4X</name>
                  <description>APORT4X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT4YCH0.</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4Y</name>
                  <description>APORT4Y used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT4YCH0.</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4YX</name>
                  <description>APORT4Y/X used. EXT_BASE = ACMP_INPUTSEL_POSSEL_APORT4YCH0.</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ACMP2</name>
      <description>ACMP2</description>
      <baseAddress>0x40080800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ACMP2</name>
        <value>55</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x07000000</resetValue>
          <resetMask>0xBF3CF70D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Analog Comparator Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INACTVAL</name>
              <description>Inactive Value</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOINV</name>
              <description>Comparator GPIO Output Invert</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTXMASTERDIS</name>
              <description>APORT Bus X Master Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTYMASTERDIS</name>
              <description>APORT Bus Y Master Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTVMASTERDIS</name>
              <description>APORT Bus Master Disable for Bus Selected By VASEL</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWRSEL</name>
              <description>Power Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVDD</name>
                  <description>AVDD supply</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVDD</name>
                  <description>DVDD supply</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOVDD0</name>
                  <description>IOVDD/IOVDD0 supply</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOVDD1</name>
                  <description>IOVDD1 supply (if part has two I/O voltages)</description>
                  <value>0x00000004</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCURACY</name>
              <description>ACMP Accuracy Mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUTRANGE</name>
              <description>Input Range</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Setting when the input can be from 0 to ACMPVDD.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTVDDDIV2</name>
                  <description>Setting when the input will always be greater than ACMPVDD/2.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LTVDDDIV2</name>
                  <description>Setting when the input will always be less than ACMPVDD/2.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRISE</name>
              <description>Rising Edge Interrupt Sense</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFALL</name>
              <description>Falling Edge Interrupt Sense</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIASPROG</name>
              <description>Bias Configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FULLBIAS</name>
              <description>Full Bias Current</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
